Revit 2027 API
RebarRoundingManager.ApplicableReinforcementRoundingSource Property
 Identifies the source of the rounding settings for this element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ReinforcementRoundingSource ApplicableReinforcementRoundingSource { get; }
Public ReadOnly Property ApplicableReinforcementRoundingSource As ReinforcementRoundingSource
	Get
public:
property ReinforcementRoundingSource ApplicableReinforcementRoundingSource {
	ReinforcementRoundingSource get ();
}
member ApplicableReinforcementRoundingSource : ReinforcementRoundingSource with get
Property Value
ReinforcementRoundingSource
Remarks
 For a Rebar or RebarInSystem element, this could be Rebar, RebarType, or ReinforcementSettings. For a RebarType, this could be RebarType or ReinforcementSettings.
See Also
Reference
RebarRoundingManager Class
Autodesk.Revit.DB.Structure Namespace